# Создать список произвольного содержания. #
# Вывести на экран третий, пятый и шестой элементы #


my_list = [0, 1, 2, "one", "two", 123, 555]
print(my_list[3], my_list[5], my_list[6])
