'''
Даны действительные числа x и y.
Для нахождения модуля использовать функцию abs(..)
'''


x = 5
y = 3
z1 = abs(x) - abs(y)
z2 = 1 + abs(x*y)
z3 = z1/z2
print(z3)
