'''
Дана длина ребра куба.
Найти объем куба и площадь всей его поверхности.
'''


a = 8
v = a ** 3
s = 6 * (a ** 2)
print(v, s)
