'''
Даны 2 действительных числа a и b.
Получить их сумму, разность и произведение.
'''


a = 13
b = 7
c1 = a + b
c2 = a - b
c3 = a * b
print(c1, c2, c3)
