'''
Ввести с клавиатуры имя пользователя.
Вывести на экран “Hello, [name]!”

'''


string1 = input()
string = str(string1)
print('Hello', string1, '!')
