# Создать три переменные, содержащие возраст трех человек, найти сумму и вывести ее на экран. #
# Создать еще одну переменную равную среднему арифметическому возрасту, и вывести это значение на экран #


age_1 = 22
age_2 = 35
age_3 = 81
age = (age_1 + age_2 + age_3)
print(age)
age_middle = ((age_1 + age_2 + age_3) / 3)
print(age_middle)
