'''
Выведите на экран n раз фразу "I am a programmer".
Число n вводит пользователь.
'''


n = int(input('Сколько раз - '))
while n > 0:
    print('I am programmer')


