# Написать произвольную строку.
# Получить подстроку, которая начинается с пятого символа, заканчивается предпредпоследним символом с шагом три.


my_string = '1519432165456482'
print(my_string[5:len(my_string)-1:3])
