# Создать произвольную строку. Получить подстроку с начала и до седьмого элемента.
# Написать два решения с использованием полной и сокращенной записи.


my_string = '0123456789'
print(my_string[0:7:1])
print(my_string[:7])
