# Создать произвольную строку. Получить подстроку с нечетными элементами
# Написать два решения с использованием полной и сокращенной записи


my_string = '0123456789'
print(my_string[1:len(my_string):2])
print(my_string[1::2])
